import matplotlib.pyplot as plt

# Данные
epochs = list(range(1, 41))
losses = [
    0.1410, 0.0592, 0.0486, 0.0407, 0.0352, 0.0299, 0.0259, 0.0231, 0.0205, 0.0184,
    0.0171, 0.0157, 0.0147, 0.0139, 0.0130, 0.0126, 0.0119, 0.0114, 0.0111, 0.0106,
    0.0102, 0.0100, 0.0099, 0.0097, 0.0093, 0.0093, 0.0090, 0.0088, 0.0087, 0.0087,
    0.0084, 0.0083, 0.0083, 0.0081, 0.0080, 0.0080, 0.0078, 0.0077, 0.0077, 0.0076
]

# Построение графика
plt.figure(figsize=(10, 6))
plt.plot(epochs, losses, marker='o')
# plt.title('Зависимость потерь от эпох')
plt.xlabel('Epoch')
plt.ylabel('Training Loss')
plt.grid(True)
plt.show()