import matplotlib.pyplot as plt

# Данные по эпохам и средним потерям
epochs = list(range(1, 41))
losses = [
    0.1034, 0.0959, 0.0920, 0.0885, 0.0844, 0.0824, 0.0788, 0.0755, 0.0739, 0.0714,
    0.0702, 0.0679, 0.0667, 0.0641, 0.0638, 0.0614, 0.0603, 0.0595, 0.0585, 0.0574,
    0.0554, 0.0548, 0.0543, 0.0532, 0.0524, 0.0519, 0.0510, 0.0499, 0.0501, 0.0494,
    0.0489, 0.0486, 0.0481, 0.0476, 0.0475, 0.0475, 0.0474, 0.0469, 0.0467, 0.0464
]

# Построение графика
plt.plot(epochs, losses, marker='o')
plt.xlabel('Epoch')
plt.ylabel('Training Loss')
# plt.title('Зависимость потерь от эпох')
plt.grid(True)
plt.show()